results/redis-cache/case-2/moderado/recommendations/run-02/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/load/recommendations-ramp-strong.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m25s max duration (incl. graceful stop):
              * ramp_load: Up to 50 looping VUs for 1m20s over 3 stages (gracefulRampDown: 5s, gracefulStop: 30s)


running (0m01.0s), 07/50 VUs, 28 complete and 0 interrupted iterations
ramp_load   [   1% ] 07/50 VUs  0m01.0s/1m20.0s

running (0m02.0s), 09/50 VUs, 75 complete and 0 interrupted iterations
ramp_load   [   2% ] 09/50 VUs  0m02.0s/1m20.0s

running (0m03.0s), 11/50 VUs, 135 complete and 0 interrupted iterations
ramp_load   [   4% ] 11/50 VUs  0m03.0s/1m20.0s

running (0m04.0s), 13/50 VUs, 209 complete and 0 interrupted iterations
ramp_load   [   5% ] 13/50 VUs  0m04.0s/1m20.0s

running (0m05.0s), 16/50 VUs, 297 complete and 0 interrupted iterations
ramp_load   [   6% ] 16/50 VUs  0m05.0s/1m20.0s

running (0m06.0s), 18/50 VUs, 401 complete and 0 interrupted iterations
ramp_load   [   7% ] 18/50 VUs  0m06.0s/1m20.0s

running (0m07.0s), 20/50 VUs, 516 complete and 0 interrupted iterations
ramp_load   [   9% ] 20/50 VUs  0m07.0s/1m20.0s

running (0m08.0s), 22/50 VUs, 644 complete and 0 interrupted iterations
ramp_load   [  10% ] 22/50 VUs  0m08.0s/1m20.0s

running (0m09.0s), 25/50 VUs, 788 complete and 0 interrupted iterations
ramp_load   [  11% ] 25/50 VUs  0m09.0s/1m20.0s

running (0m10.0s), 27/50 VUs, 943 complete and 0 interrupted iterations
ramp_load   [  12% ] 27/50 VUs  0m10.0s/1m20.0s

running (0m11.0s), 29/50 VUs, 1111 complete and 0 interrupted iterations
ramp_load   [  14% ] 29/50 VUs  0m11.0s/1m20.0s

running (0m12.0s), 31/50 VUs, 1293 complete and 0 interrupted iterations
ramp_load   [  15% ] 31/50 VUs  0m12.0s/1m20.0s

running (0m13.0s), 34/50 VUs, 1486 complete and 0 interrupted iterations
ramp_load   [  16% ] 34/50 VUs  0m13.0s/1m20.0s

running (0m14.0s), 36/50 VUs, 1653 complete and 0 interrupted iterations
ramp_load   [  17% ] 36/50 VUs  0m14.0s/1m20.0s

running (0m15.0s), 38/50 VUs, 1850 complete and 0 interrupted iterations
ramp_load   [  19% ] 38/50 VUs  0m15.0s/1m20.0s

running (0m16.0s), 40/50 VUs, 2001 complete and 0 interrupted iterations
ramp_load   [  20% ] 40/50 VUs  0m16.0s/1m20.0s

running (0m17.0s), 43/50 VUs, 2175 complete and 0 interrupted iterations
ramp_load   [  21% ] 43/50 VUs  0m17.0s/1m20.0s

running (0m18.0s), 45/50 VUs, 2402 complete and 0 interrupted iterations
ramp_load   [  22% ] 45/50 VUs  0m18.0s/1m20.0s

running (0m19.0s), 47/50 VUs, 2616 complete and 0 interrupted iterations
ramp_load   [  24% ] 47/50 VUs  0m19.0s/1m20.0s

running (0m20.0s), 49/50 VUs, 2851 complete and 0 interrupted iterations
ramp_load   [  25% ] 49/50 VUs  0m20.0s/1m20.0s

running (0m21.0s), 50/50 VUs, 3095 complete and 0 interrupted iterations
ramp_load   [  26% ] 50/50 VUs  0m21.0s/1m20.0s

running (0m22.0s), 50/50 VUs, 3335 complete and 0 interrupted iterations
ramp_load   [  27% ] 50/50 VUs  0m22.0s/1m20.0s

running (0m23.0s), 50/50 VUs, 3582 complete and 0 interrupted iterations
ramp_load   [  29% ] 50/50 VUs  0m23.0s/1m20.0s

running (0m24.0s), 50/50 VUs, 3829 complete and 0 interrupted iterations
ramp_load   [  30% ] 50/50 VUs  0m24.0s/1m20.0s

running (0m25.0s), 50/50 VUs, 4080 complete and 0 interrupted iterations
ramp_load   [  31% ] 50/50 VUs  0m25.0s/1m20.0s

running (0m26.0s), 50/50 VUs, 4327 complete and 0 interrupted iterations
ramp_load   [  32% ] 50/50 VUs  0m26.0s/1m20.0s

running (0m27.0s), 50/50 VUs, 4570 complete and 0 interrupted iterations
ramp_load   [  34% ] 50/50 VUs  0m27.0s/1m20.0s

running (0m28.0s), 50/50 VUs, 4816 complete and 0 interrupted iterations
ramp_load   [  35% ] 50/50 VUs  0m28.0s/1m20.0s

running (0m29.0s), 50/50 VUs, 5014 complete and 0 interrupted iterations
ramp_load   [  36% ] 50/50 VUs  0m29.0s/1m20.0s

running (0m30.0s), 50/50 VUs, 5244 complete and 0 interrupted iterations
ramp_load   [  37% ] 50/50 VUs  0m30.0s/1m20.0s

running (0m31.0s), 50/50 VUs, 5473 complete and 0 interrupted iterations
ramp_load   [  39% ] 50/50 VUs  0m31.0s/1m20.0s

running (0m32.0s), 50/50 VUs, 5715 complete and 0 interrupted iterations
ramp_load   [  40% ] 50/50 VUs  0m32.0s/1m20.0s

running (0m33.0s), 50/50 VUs, 5895 complete and 0 interrupted iterations
ramp_load   [  41% ] 50/50 VUs  0m33.0s/1m20.0s

running (0m34.0s), 50/50 VUs, 6055 complete and 0 interrupted iterations
ramp_load   [  42% ] 50/50 VUs  0m34.0s/1m20.0s

running (0m35.0s), 50/50 VUs, 6241 complete and 0 interrupted iterations
ramp_load   [  44% ] 50/50 VUs  0m35.0s/1m20.0s

running (0m36.0s), 50/50 VUs, 6485 complete and 0 interrupted iterations
ramp_load   [  45% ] 50/50 VUs  0m36.0s/1m20.0s

running (0m37.0s), 50/50 VUs, 6716 complete and 0 interrupted iterations
ramp_load   [  46% ] 50/50 VUs  0m37.0s/1m20.0s

running (0m38.0s), 50/50 VUs, 6776 complete and 0 interrupted iterations
ramp_load   [  47% ] 50/50 VUs  0m38.0s/1m20.0s

running (0m39.0s), 50/50 VUs, 6865 complete and 0 interrupted iterations
ramp_load   [  49% ] 50/50 VUs  0m39.0s/1m20.0s

running (0m40.0s), 50/50 VUs, 7065 complete and 0 interrupted iterations
ramp_load   [  50% ] 50/50 VUs  0m40.0s/1m20.0s

running (0m41.0s), 50/50 VUs, 7296 complete and 0 interrupted iterations
ramp_load   [  51% ] 50/50 VUs  0m41.0s/1m20.0s

running (0m42.0s), 50/50 VUs, 7543 complete and 0 interrupted iterations
ramp_load   [  52% ] 50/50 VUs  0m42.0s/1m20.0s

running (0m43.0s), 50/50 VUs, 7803 complete and 0 interrupted iterations
ramp_load   [  54% ] 50/50 VUs  0m43.0s/1m20.0s

running (0m44.0s), 50/50 VUs, 8068 complete and 0 interrupted iterations
ramp_load   [  55% ] 50/50 VUs  0m44.0s/1m20.0s

running (0m45.0s), 50/50 VUs, 8340 complete and 0 interrupted iterations
ramp_load   [  56% ] 50/50 VUs  0m45.0s/1m20.0s

running (0m46.0s), 50/50 VUs, 8607 complete and 0 interrupted iterations
ramp_load   [  57% ] 50/50 VUs  0m46.0s/1m20.0s

running (0m47.0s), 50/50 VUs, 8864 complete and 0 interrupted iterations
ramp_load   [  59% ] 50/50 VUs  0m47.0s/1m20.0s

running (0m48.0s), 50/50 VUs, 9123 complete and 0 interrupted iterations
ramp_load   [  60% ] 50/50 VUs  0m48.0s/1m20.0s

running (0m49.0s), 50/50 VUs, 9391 complete and 0 interrupted iterations
ramp_load   [  61% ] 50/50 VUs  0m49.0s/1m20.0s

running (0m50.0s), 50/50 VUs, 9624 complete and 0 interrupted iterations
ramp_load   [  62% ] 50/50 VUs  0m50.0s/1m20.0s

running (0m51.0s), 50/50 VUs, 9878 complete and 0 interrupted iterations
ramp_load   [  64% ] 50/50 VUs  0m51.0s/1m20.0s

running (0m52.0s), 50/50 VUs, 10134 complete and 0 interrupted iterations
ramp_load   [  65% ] 50/50 VUs  0m52.0s/1m20.0s

running (0m53.0s), 50/50 VUs, 10400 complete and 0 interrupted iterations
ramp_load   [  66% ] 50/50 VUs  0m53.0s/1m20.0s

running (0m54.0s), 50/50 VUs, 10605 complete and 0 interrupted iterations
ramp_load   [  67% ] 50/50 VUs  0m54.0s/1m20.0s

running (0m55.0s), 50/50 VUs, 10843 complete and 0 interrupted iterations
ramp_load   [  69% ] 50/50 VUs  0m55.0s/1m20.0s

running (0m56.0s), 50/50 VUs, 11111 complete and 0 interrupted iterations
ramp_load   [  70% ] 50/50 VUs  0m56.0s/1m20.0s

running (0m57.0s), 50/50 VUs, 11384 complete and 0 interrupted iterations
ramp_load   [  71% ] 50/50 VUs  0m57.0s/1m20.0s

running (0m58.0s), 50/50 VUs, 11669 complete and 0 interrupted iterations
ramp_load   [  72% ] 50/50 VUs  0m58.0s/1m20.0s

running (0m59.0s), 50/50 VUs, 11944 complete and 0 interrupted iterations
ramp_load   [  74% ] 50/50 VUs  0m59.0s/1m20.0s

running (1m00.0s), 50/50 VUs, 12220 complete and 0 interrupted iterations
ramp_load   [  75% ] 50/50 VUs  1m00.0s/1m20.0s

running (1m01.0s), 50/50 VUs, 12503 complete and 0 interrupted iterations
ramp_load   [  76% ] 50/50 VUs  1m01.0s/1m20.0s

running (1m02.0s), 50/50 VUs, 12765 complete and 0 interrupted iterations
ramp_load   [  77% ] 50/50 VUs  1m02.0s/1m20.0s

running (1m03.0s), 50/50 VUs, 13045 complete and 0 interrupted iterations
ramp_load   [  79% ] 50/50 VUs  1m03.0s/1m20.0s

running (1m04.0s), 50/50 VUs, 13337 complete and 0 interrupted iterations
ramp_load   [  80% ] 50/50 VUs  1m04.0s/1m20.0s

running (1m05.0s), 50/50 VUs, 13629 complete and 0 interrupted iterations
ramp_load   [  81% ] 50/50 VUs  1m05.0s/1m20.0s

running (1m06.0s), 47/50 VUs, 13907 complete and 0 interrupted iterations
ramp_load   [  82% ] 47/50 VUs  1m06.0s/1m20.0s

running (1m07.0s), 44/50 VUs, 14154 complete and 0 interrupted iterations
ramp_load   [  84% ] 44/50 VUs  1m07.0s/1m20.0s

running (1m08.0s), 41/50 VUs, 14407 complete and 0 interrupted iterations
ramp_load   [  85% ] 41/50 VUs  1m08.0s/1m20.0s

running (1m09.0s), 37/50 VUs, 14648 complete and 0 interrupted iterations
ramp_load   [  86% ] 37/50 VUs  1m09.0s/1m20.0s

running (1m10.0s), 34/50 VUs, 14869 complete and 0 interrupted iterations
ramp_load   [  87% ] 34/50 VUs  1m10.0s/1m20.0s

running (1m11.0s), 31/50 VUs, 15070 complete and 0 interrupted iterations
ramp_load   [  89% ] 31/50 VUs  1m11.0s/1m20.0s

running (1m12.0s), 27/50 VUs, 15253 complete and 0 interrupted iterations
ramp_load   [  90% ] 27/50 VUs  1m12.0s/1m20.0s

running (1m13.0s), 24/50 VUs, 15418 complete and 0 interrupted iterations
ramp_load   [  91% ] 24/50 VUs  1m13.0s/1m20.0s

running (1m14.0s), 21/50 VUs, 15564 complete and 0 interrupted iterations
ramp_load   [  92% ] 21/50 VUs  1m14.0s/1m20.0s

running (1m15.0s), 17/50 VUs, 15687 complete and 0 interrupted iterations
ramp_load   [  94% ] 17/50 VUs  1m15.0s/1m20.0s

running (1m16.0s), 14/50 VUs, 15788 complete and 0 interrupted iterations
ramp_load   [  95% ] 14/50 VUs  1m16.0s/1m20.0s

running (1m17.0s), 11/50 VUs, 15870 complete and 0 interrupted iterations
ramp_load   [  96% ] 11/50 VUs  1m17.0s/1m20.0s

running (1m18.0s), 08/50 VUs, 15928 complete and 0 interrupted iterations
ramp_load   [  97% ] 08/50 VUs  1m18.0s/1m20.0s

running (1m19.0s), 04/50 VUs, 15969 complete and 0 interrupted iterations
ramp_load   [  99% ] 04/50 VUs  1m19.0s/1m20.0s

running (1m20.0s), 01/50 VUs, 15984 complete and 0 interrupted iterations
ramp_load   [ 100% ] 01/50 VUs  1m20.0s/1m20.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=96.86ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 47955   598.549828/s
    checks_succeeded...: 100.00% 47955 out of 47955
    checks_failed......: 0.00%   0 out of 47955

    ✓ status 200
    ✓ response has userId
    ✓ response has recommendations

    HTTP
    http_req_duration..............: avg=38.94ms  min=2.46ms  med=25.19ms  max=1.38s p(90)=71.08ms  p(95)=96.86ms 
      { expected_response:true }...: avg=38.94ms  min=2.46ms  med=25.19ms  max=1.38s p(90)=71.08ms  p(95)=96.86ms 
    http_req_failed................: 0.00%  0 out of 15985
    http_reqs......................: 15985  199.516609/s

    EXECUTION
    iteration_duration.............: avg=198.62ms min=155.1ms med=184.87ms max=1.55s p(90)=233.69ms p(95)=261.37ms
    iterations.....................: 15985  199.516609/s
    vus............................: 1      min=1          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 425 MB 5.3 MB/s
    data_sent......................: 1.5 MB 18 kB/s



running (1m20.1s), 00/50 VUs, 15985 complete and 0 interrupted iterations
ramp_load ✓ [ 100% ] 00/50 VUs  1m20s